Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayers Property
 Cannot create wall - its layers would degenerate or intersect. Reduce the wall's height or slant.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateSlantedWallWithSingularLayers { get; }
Public Shared ReadOnly Property CannotCreateSlantedWallWithSingularLayers As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateSlantedWallWithSingularLayers {
	FailureDefinitionId^ get ();
}
static member CannotCreateSlantedWallWithSingularLayers : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace